Autodesk.Revit.DB.BasicFileInfo.Extract(System.String)
Retrieves basic file data.
file:
The full path to the file to be queried.
Returns:
If successful, basic file data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A file is saved in very old version of Revit without basic file data.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo
Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
Remarks:
This gives fast access to said information without fully opening the file.
Since:
2013